[
    {
        "idProject": 1,
        "name": "Agenda sur le Terminal",
        "type": "SAE",
        "description": "Le but de cette SAÉ était de créer une sorte d'application de calendrier dans le terminal. Ce calendrier devait être codé en C++, et il devait proposer à son démarrage plusieurs fonctionnalités :\n Regarder s'il y avait un agenda déjà présent dans le dossier actuel.\n Dès son lancement, l'agenda propose ce menu :\n Afficher les événements présents dans le calendrier\n Renommer un événement\n Ajouter un événement\n Supprimer un événement\n Exporter l'agenda en HTML\n Enregistrer l'agenda\n Quitter",
        "lien": null,
        "annexe": "Agenda_video.mp4",
        "typeAnnexe": "video",
        "dates": "Octobre 2023 - Janvier 2024",
        "langages": [
            { "langage": "c++_logo.png" },
            { "langage": "html_logo.png" },
            { "langage": "css_logo.png" },
            { "langage": "bash_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Manque d'expérience en langage C++",
                "solution": "Lire la documentation, regarder des tutoriels et des cours sur YouTube"
            },
            {  
                "probleme": "Le temps imparti",
                "solution": "Si on est mal organisé, le projet était impossible à réaliser, mais ce n'était pas mon cas !"
            },
            {  
                "probleme": "Recommencement du projet à partir de zéro",
                "solution": "Ayant énormément d'erreurs, j'ai décidé de tout recommencer pour repartir sur de bonnes bases"
            }
        ]
    },  
    {
        "idProject": 2,
        "name": "Site internet de vente de produits artisanaux",
        "type": "Projet Personnel",
        "description": "Ayant une mère qui confectionne des produits artisanaux faits main, j'ai décidé de lui apporter un coup de pouce à ma manière, en lui créant un site internet où l'on peut voir les différents articles qu'elle propose. \nVoici un lien vers le site internet réalisé.",
        "lien": null,
        "annexe": "Screen_MLC_2.png",
        "typeAnnexe": "img",
        "dates": "Décembre 2023 - Juillet 2024",
        "langages": [
            { "langage": "html_logo.png" },
            { "langage": "css_logo.png" },
            { "langage": "javascript_logo.png" },
            { "langage": "node.js_logo.png" },
            { "langage": "postgresql_logo.png" }
        ],
        "problemes": [
            {
                "probleme": "Manque de connaissances en JavaScript",
                "solution": "Lire la documentation, regarder des tutoriels et des cours sur YouTube pour le JavaScript"
            },
            {
                "probleme": "Manque de temps",
                "solution": "Essayer de 'grappiller' du temps libre pour avancer"
            },
            {
                "probleme": "Créer une base de données afin de gérer les articles (ajouter, supprimer, mettre à jour les informations des articles, etc.)",
                "solution": "Utilisation du langage JSON pour la base de données"
            },
            {
                "probleme": "Héberger le site web sur un serveur pour que n'importe quelle personne puisse s'y rendre",
                "solution": "Utilisation de l'hébergeur GitHub Pages qui offre le protocole HTTPS par défaut et totalement gratuit"
            }
        ]
    },
    {
        "idProject": 3,
        "name": "Application de recette de cuisine",
        "type": "SAE",
        "description": "Le but de cette SAÉ était de créer une application en binôme. \n Nous avons dû tirer au sort un sujet, et nous sommes tombés sur les recettes de cuisine. Nous avons eu l'idée de l'appeler \"EZ-Cook\", qui est une référence à une bibliothèque C++ permettant d'avoir une interface nommée \"EZ-Draw\", mais aussi parce que la traduction de ce nom donne \"Cuisine facile\".",
        "lien": null,
        "annexe": "EZCook_video.mp4",
        "typeAnnexe": "video",
        "dates": "Avril 2024 - Juin 2024",
        "langages": [
            { "langage": "c++_logo.png" },
            { "langage": "Qt_logo.png" },
            { "langage": "json_logo.png" },
            { "langage": "xml_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Manque de temps",
                "solution": "Nous n'avons pas eu le temps de développer certaines fonctionnalités (traduire l'application en fonction d'une langue, faire correspondre les recettes cherchées avec celles trouvées)"
            },
            {  
                "probleme": "GitHub",
                "solution": "Mon binôme a rencontré un problème en ajoutant le programme sur notre dépôt GitHub commun, ce qui ne s'est pas passé comme prévu. Il a eu une erreur, puis moi aussi, ce qui nous a contraints à devoir créer un nouveau dépôt GitHub pour la sauvegarde des fichiers. Heureusement, nous avions quand même pu enregistrer les fichiers manuellement."
            }
        ]
    },
    {
        "idProject": 4,
        "name": "Application de recherche de restaurant dans une ville",
        "type": "Exercice - BUT Informatique",
        "description": "Le but de cet exercice était de créer une application client-riche. Le thème était au choix, et j'ai choisi une application de restaurant. Mon application devait rechercher via une API tous les restaurants de France et afficher les détails.",
        "lien": null,
        "annexe": "EZFood_video.mp4",
        "typeAnnexe": "video",
        "dates": "Octobre 2024",
        "langages": [
            { "langage": "html_logo.png" },
            { "langage": "css_logo.png" },
            { "langage": "javascript_logo.png" },
            { "langage": "api_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Prise en main de WebPack, un bundler permettant de compiler et d'optimiser des fichiers JavaScript (et autres ressources) en un seul fichier. Un environnement tout nouveau pour moi, assez complexe au début.",
                "solution": "Lire la documentation et regarder des tutoriels pour mieux comprendre les attentes de WebPack"
            }
        ]
    },
    {
        "idProject": 5,
        "name": "Jeu vidéo d'aventure en Python - Nautilus",
        "type": "Projet Personnel",
        "description": "Nautilus est un jeu d'aventure où un naufragé doit survivre, explorer une île hostile et trouver un moyen de s'échapper avant l'arrivée de nouveaux dangers.",
        "lien": null,
        "annexe": "Nautilus_video.mp4",
        "typeAnnexe": "video",
        "dates": "Juin 2024 - Non fini",
        "langages": [
            { "langage": "python_logo.png" },
            { "langage": "tiled_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Problèmes de collisions",
                "solution": "Je me suis rendu compte après un certain temps que c'était lié à une mauvaise gestion des calques Tiled et j'ai corrigé en réorganisant la structure des calques."
            },
            {  
                "probleme": "Il manque des interactions clés (couper du bois, miner de la pierre, cueillir de la nourriture), ainsi que des ennemis et animations supplémentaires",
                "solution": "En cours d'implémentation avec des ajouts progressifs basés sur des feedbacks."
            },
            {  
                "probleme": "Manque de temps",
                "solution": "Essayer de 'grappiller' du temps libre pour avancer"
            }
        ]
    },
    {
        "idProject": 6,
        "name": "Application de gestion d'album de musique en Java",
        "type":"Projet - BUT Informatique",
        "description": "Ce logiciel permet de gérer une collection d'albums de musique avec une interface graphique. Il est possible d'ajouter un album, d'en supprimer, de modifier, de consulter, et de sauvegarder. Il est possible d'effectuer une recherche par titre, par artiste, par date, par genre. Lors de la consultation, on pourra trier les résultats par titre d'albums, par artiste, par date, par genre. J'ai utilisé une base de donnéeshébergée sur un serveur (AlwaysData).",
        "lien": null,
        "annexe": "SoundifyApp_video.mp4",
        "typeAnnexe": "video",
        "dates": "Novembre 2024 - Décembre 2024",
        "langages": [
            { "langage": "java_logo.png" },
            { "langage": "postgresql_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Aucun problèmes, une vrai partie de plaisir !",
                "solution": "N/A"
            }
        ]
    },
    {
        "idProject": 7,
        "name": "Application d'apprentissage de la lecture et de l'écriture pour les enfants",
        "type": "SAE",
        "description": "Dans le cadre de cette SAE, nous devions, en équipe de cinq sous la méthodologie Scrum, réaliser une application visant à aider les enfants entrant en école primaire à apprendre à lire. J'occupais le rôle de Product Owner. Nous devions prendre en compte les éventuelles difficultés d'attention des enfants. L'application devait proposer des exercices ludiques et intégrer une progression, que ce soit dans une fonctionnalité précise ou dans l'application globale.",
        "lien": null,
        "annexe": "leRoyaumeDesLettres_video.mp4",
        "typeAnnexe": "video",
        "dates": "Septembre 2024 - Janvier 2025",
        "langages": [
            { "langage": "html_logo.png" },
            { "langage": "css_logo.png" },
            { "langage": "javascript_logo.png" },
            { "langage": "node.js_logo.png" },
            { "langage": "mysql_logo.png" }
        ],
        "problemes": [
            {  
                "probleme": "Panne de GitLab, l'outil de collaboration de code, survenue en décembre, trois semaines avant le rendu final.",
                "solution": "Nous avons dû trouver une solution rapide pour permettre à tous les membres de l'équipe de continuer à travailler en attendant la réparation de GitLab. Nous avons opté pour Bitbucket."
            },
            {
                "probleme": "Manque de formation sur la création de serveurs Node.js et leur liaison avec une base de données pour insérer, supprimer ou modifier des éléments depuis l'application.",
                "solution": "Je me suis chargé de la partie backend de l'application en suivant des tutoriels sur la création d'un serveur Node.js, puis en consultant la documentation pour intégrer la base de données avec le serveur."
            }
        ]
    } 
]
